{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      ".": 5,
      "a": 6,
      "b": 7,
      "c": 8,
      "d": 9,
      "e": 10,
      "f": 11,
      "g": 12,
      "h": 13,
      "i": 14,
      "j": 15,
      "k": 16,
      "l": 17,
      "m": 18,
      "n": 19,
      "o": 20,
      "p": 21,
      "q": 22,
      "r": 23,
      "s": 24,
      "t": 25,
      "u": 26,
      "v": 27,
      "w": 28,
      "x": 29,
      "y": 30,
      "z": 31,
      "##s": 32,
      "##i": 33,
      "##t": 34,
      "##r": 35,
      "##o": 36,
      "##c": 37,
      "##e": 38,
      "##n": 39,
      "##g": 40,
      "##q": 41,
      "##u": 42,
      "##k": 43,
      "##z": 44,
      "##a": 45,
      "##v": 46,
      "##x": 47,
      "##h": 48,
      "##l": 49,
      "##f": 50,
      "##d": 51,
      "##w": 52,
      "##m": 53,
      "##p": 54,
      "##y": 55,
      "##he": 56,
      "the": 57,
      "##at": 58,
      "to": 59,
      "##en": 60,
      "##an": 61,
      "##mp": 62,
      "is": 63,
      "imp": 64,
      "##iz": 65,
      "##tan": 66,
      "##ro": 67,
      "##rtan": 68,
      "##ortan": 69,
      "##ce": 70,
      "##ken": 71,
      "token": 72,
      "importan": 73,
      "##ces": 74,
      "tokeniz": 75,
      "important": 76,
      "an": 77,
      "in": 78,
      "pro": 79,
      "##io": 80,
      "##in": 81,
      "##atio": 82,
      "##cess": 83,
      "tokenizatio": 84,
      "process": 85,
      "tokenization": 86,
      "do": 87,
      "of": 88,
      "si": 89,
      "st": 90,
      "##ck": 91,
      "##ep": 92,
      "##ge": 93,
      "##her": 94,
      "##ing": 95,
      "dog": 96,
      "step": 97,
      "bi": 98,
      "ba": 99,
      "bro": 100,
      "cat": 101,
      "fo": 102,
      "fe": 103,
      "fl": 104,
      "ju": 105,
      "lo": 106,
      "la": 107,
      "lan": 108,
      "ni": 109,
      "nl": 110,
      "nat": 111,
      "on": 112,
      "ov": 113,
      "qu": 114,
      "se": 115,
      "te": 116,
      "win": 117,
      "##ick": 118,
      "##ts": 119,
      "##ther": 120,
      "##rk": 121,
      "##ra": 122,
      "##rd": 123,
      "##ow": 124,
      "##ock": 125,
      "##er": 126,
      "##gu": 127,
      "##gh": 128,
      "##qu": 129,
      "##ud": 130,
      "##ura": 131,
      "##zy": 132,
      "##age": 133,
      "##xt": 134,
      "##ll": 135,
      "##ly": 136,
      "##dow": 137,
      "##wn": 138,
      "##ather": 139,
      "toge": 140,
      "##ences": 141,
      "##mps": 142,
      "tokenizing": 143,
      "processing": 144,
      "sits": 145,
      "sill": 146,
      "bird": 147,
      "bark": 148,
      "brown": 149,
      "fox": 150,
      "feather": 151,
      "flock": 152,
      "jumps": 153,
      "loud": 154,
      "lazy": 155,
      "langu": 156,
      "nigh": 157,
      "nlp": 158,
      "natura": 159,
      "over": 160,
      "quick": 161,
      "sequ": 162,
      "text": 163,
      "window": 164,
      "together": 165,
      "birds": 166,
      "barks": 167,
      "loudly": 168,
      "language": 169,
      "night": 170,
      "natural": 171,
      "sequences": 172
    }
  }
}